## Indexing-Selection-Filtering in Pandas

In [2]:
#import the libraries
import pandas as pd 
import numpy as np

In [3]:
a=pd.Series([14,68,46,24,83],index=["a","b","c","d","e"])
a

a    14
b    68
c    46
d    24
e    83
dtype: int64

#### selecting the value at index d.

In [5]:
a['d']

24

#### You can do the same thing by entering the index number in square brackets.

In [7]:
a[2]

46

#### Selecting multiple rows by using slicing.

In [9]:
a[0:4]

a    14
b    68
c    46
d    24
dtype: int64

#### Selecting specific rows.

In [11]:
a[["a","c"]]

a    14
c    46
dtype: int64

#### Selecting specific rows by entering the index number.

In [13]:
a[[0,3]]

a    14
d    24
dtype: int64

#### 2. Filtering in Series

print the values less than 40

In [16]:
a['a':'c']=77
a

a    77
b    77
c    77
d    24
e    83
dtype: int64

#### 3. DataFrame Indexing

In [18]:
data = [['Robin',26,45.34],['Karan',25,78.5],['Priya',23,87.67],['Varun',22,56],['Keisha',23,97]]
df=pd.DataFrame(data,columns=['Name','Age','Marks'])
df

     Name  Age  Marks
0   Robin   26  45.34
1   Karan   25  78.50
2   Priya   23  87.67
3   Varun   22  56.00
4  Keisha   23  97.00

#### Selecting the column named Name

In [20]:
df['Name']

0     Robin
1     Karan
2     Priya
3     Varun
4    Keisha
Name: Name, dtype: object

#### Selecting multiple columns

In [22]:
df[['Name','Marks']]

     Name  Marks
0   Robin  45.34
1   Karan  78.50
2   Priya  87.67
3   Varun  56.00
4  Keisha  97.00

 #### slicing the rows.

In [67]:
df[:2]

    Name  Age  Marks
0  Robin   26  45.34
1  Karan   25  78.50

### Filtering in DataFrame

In [70]:
df[df["Marks"]>60]

     Name  Age  Marks
1   Karan   25  78.50
2   Priya   23  87.67
4  Keisha   23  97.00

### Selecting Rows and Columns with loc and iloc method

* .loc() Label based
* .iloc() Integer based

#### Using iloc [ ] method

* df.iloc[row no, col no]

In [76]:
df

     Name  Age  Marks
0   Robin   26  45.34
1   Karan   25  78.50
2   Priya   23  87.67
3   Varun   22  56.00
4  Keisha   23  97.00

#### df.iloc[2]

In [91]:
df.iloc[2]

Name     Priya
Age         23
Marks    87.67
Name: 2, dtype: object

#### Selecting specific columns (Name, Marks) of multiple rows (1 and 3)

In [94]:
df.iloc[[1,3],[0,2]]

    Name  Marks
1  Karan   78.5
3  Varun   56.0

#### selecting all rows and all columns

In [97]:
df

     Name  Age  Marks
0   Robin   26  45.34
1   Karan   25  78.50
2   Priya   23  87.67
3   Varun   22  56.00
4  Keisha   23  97.00

#### OR

In [100]:
df.iloc[:,:]

     Name  Age  Marks
0   Robin   26  45.34
1   Karan   25  78.50
2   Priya   23  87.67
3   Varun   22  56.00
4  Keisha   23  97.00

#### selecting all rows and columns (Name to Age)

In [103]:
df.iloc[:,:2]

     Name  Age
0   Robin   26
1   Karan   25
2   Priya   23
3   Varun   22
4  Keisha   23

#### selecting all rows and columns (Name and Marks)

In [106]:
df.iloc[:,[0,2]]

     Name  Marks
0   Robin  45.34
1   Karan  78.50
2   Priya  87.67
3   Varun  56.00
4  Keisha  97.00

### 2. Using loc Method

In [109]:
df

     Name  Age  Marks
0   Robin   26  45.34
1   Karan   25  78.50
2   Priya   23  87.67
3   Varun   22  56.00
4  Keisha   23  97.00

#### select 2nd index row

In [123]:
df.loc[2]

Name     Priya
Age         23
Marks    87.67
Name: 2, dtype: object

#### Selecting specific columns (Name, Marks) of multiple rows (1 and 3)

In [126]:
df.iloc[[1,3],[0,2]]

    Name  Marks
1  Karan   78.5
3  Varun   56.0

#### selecting all rows and all columns

In [129]:
df

     Name  Age  Marks
0   Robin   26  45.34
1   Karan   25  78.50
2   Priya   23  87.67
3   Varun   22  56.00
4  Keisha   23  97.00

#### or

In [132]:
df.loc[:,:]

     Name  Age  Marks
0   Robin   26  45.34
1   Karan   25  78.50
2   Priya   23  87.67
3   Varun   22  56.00
4  Keisha   23  97.00

#### selecting all rows and columns (Name to Age)

In [135]:
df.loc[:,:'Age']

     Name  Age
0   Robin   26
1   Karan   25
2   Priya   23
3   Varun   22
4  Keisha   23

#### selecting all rows and columns (Name and Marks)

In [138]:
df.loc[:,['Name','Marks']]

     Name  Marks
0   Robin  45.34
1   Karan  78.50
2   Priya  87.67
3   Varun  56.00
4  Keisha  97.00

### 3. Methods to Select a Single Columns as Series or DataFrame

#### Method 1

* Selection Single Column as Series

In [158]:
df['Name']

0     Robin
1     Karan
2     Priya
3     Varun
4    Keisha
Name: Name, dtype: object

#### Method 2

* Selection single columns as DataFrame

In [165]:
df[['Name']]

     Name
0   Robin
1   Karan
2   Priya
3   Varun
4  Keisha

#### Method 3

* Selection Single Column as Series

In [169]:
df.Name

0     Robin
1     Karan
2     Priya
3     Varun
4    Keisha
Name: Name, dtype: object

#### Method 4

* Selection Single Column as Series

In [173]:
df.iloc[:,0]

0     Robin
1     Karan
2     Priya
3     Varun
4    Keisha
Name: Name, dtype: object

#### Method 5

* Selection single columns as DataFrame

In [177]:
df.iloc[:,0:1]

     Name
0   Robin
1   Karan
2   Priya
3   Varun
4  Keisha

#### Method 6
* Selection Single Column as Series

In [180]:
df.loc[:,'Name']

0     Robin
1     Karan
2     Priya
3     Varun
4    Keisha
Name: Name, dtype: object

#### Method 7
* Selection single columns as DataFrame

In [194]:
df.loc[:,'Name':'Name']

     Name
0   Robin
1   Karan
2   Priya
3   Varun
4  Keisha